const inventory = []
let room = "вход"
alert(
    "ЛАБИРИНТ ХРАНИТЕЛЯ\n\n" +
    "Найдите зал босса и соберите всё для победы:\n" +
    "ключ, магическую траву, магический меч и защитный амулет."
)
while (true) {

    if (room === "вход") {
        const choice = prompt(
            "ВЫ У ВХОДА\n" +
            "1 — Западный коридор\n" +
            "2 — Восточный коридор\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "западный коридор";
        } else if (choice === "2") {
            room = "восточный коридор";
        } else {
            alert("Такого прохода нет.");
        }
    }

    if (room === "западный коридор") {
        const choice = prompt(
            "ЗАПАДНЫЙ КОРИДОР\n" +
            "1 — Пройти в забытую библиотеку\n" +
            "2 — Вернуться к двери\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "библиотека";
        } else if (choice === "2") {
            room = "вход";
        } else {
            alert("Такого прохода нет.");
        }
    }

    if (room === "библиотека") {
        const choice = prompt(
            "ЗАБЫТАЯ БИБЛИОТЕКА\n" +
            "Вы заходите в плохо освещенную комнату с большим количеством книжных стеллажей, и раскиданными по полу книгами.\n" +
            "1 — Подойти к стеллажу\n" +
            "2 — Проверить лежащие на полу книги\n" +
            "3 — Вернуться в западный коридор\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "у стеллажа";
        } else if (choice === "2") {
            room = "на полу";
        } else if (choice === "3") {
            room = "западный коридор";
        } else {
            alert("Такого прохода нет.");
        }
    }

    if (room === "у стеллажа") {
        const choice = prompt(
            "КНИЖНЫЙ СТЕЛЛАЖ\n" +
            "1 — Осмотреть верхнюю полку\n" +
            "2 — Вернуться ко входу в библиотеку\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "верхняя полка";
        } else if (choice === "2") {
            room = "библиотека";
        } else {
            alert("Такого действия нет.");
        }
    }

    if (room === "верхняя полка") {
        alert(
            "ВЕРХНЯЯ ПОЛКА\n" +
            "Вы нашли несколько стоящих на полке запылившихся книг, одна из них странно переливается в свету свечей."
        );
        const choice = prompt(
            "1 — Достать пыльные книги\n" +
            "2 — Попробовать достать странную книгу\n" +
            "3 — Вернуться ко входу в библиотеку\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "пыльные книги";
        } else if (choice === "2") {
            room = "странная книга";
        } else if (choice === "3") {
            room = "библиотека";
        } else {
            alert("Такого прохода нет.");
        }
    }

    if (room === "пыльные книги") {
        alert(
            "ВЕРХНЯЯ ПОЛКА\n" +
            "Обычные пыльные книги, стоящие здесь не один десяток лет."
        );
        const choice = prompt(
            "1 — Вернуться ко входу в библиотеку\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "библиотека";
        } else {
            alert("Такого прохода нет.");
        }
    }

    if (room === "странная книга") {
        alert(
            "ВЕРХНЯЯ ПОЛКА\n" +
            "Книга с грохотом наклоняется к вам, это был рычаг."
        );
        const choice = prompt(
            "1 — Оглянуться\n" +
            "2 — Вернуться ко входу в библиотеку\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "углубление";
        } else if (choice === "2") {
            room = "библиотека";
        } else {
            alert("Такого прохода нет.");
        }
    }

    if (room === "углубление") {
        alert(
            "БИБЛИОТЕКА\n" +
            "Вы заметили небольшое углубление в стене, открывшееся только что.\n" +
            "Там лежит маленький сундук."
        );
        const choice = prompt(
            "1 — Открыть сундук\n" +
            "2 — Вернуться ко входу в библиотеку\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "сундук";
        } else if (choice === "2") {
            room = "библиотека";
        } else {
            alert("Такого прохода нет.");
        }
    }

    if (room === "сундук") {
        const takeKey = confirm("В сундуке лежит ключ. Взять его?");
        if (takeKey === true) {
            inventory.push("ключ");
            alert("Ключ добавлен в рюкзак!");
        } else {
            alert("Вы оставили ключ на полке.");
        }
        alert(
            "Осталось найти магическую траву и меч"
        );
        const choice = prompt(
            "1 — Вернуться ко входу в библиотеку\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "библиотека";
        } else {
            alert("Такого прохода нет.");
        }
    }

    if (room === "на полу") {
        alert(
            "ПЫЛЬНЫЙ КОВЕР\n" +
            "Книги разбросанные по полу явно упали не сами, кто оставил их здесь?"
        );
        const choice = prompt(
            "1 — Вернуться ко входу в библиотеку\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "библиотека";
        } else {
            alert("Такого прохода нет.");
        }
    }

    // TODO: добавьте переход и напишите блок восточного коридора.
    if (room === "восточный коридор") {
        const choice = prompt(
            "ВОСТОЧНЫЙ КОРИДОР\n" +
            "1 — Пройти в искрящийся сад\n" +
            "2 — Пройти в темную оружейную\n" +
            "3 — Пройти в небесное святилище\n" +
            "4 — Пройти в комнату Босса\n" +
            "5 — Вернуться к двери\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "сад";
        } else if (choice === "2") {
            room = "оружейная";
        } else if (choice === "3") {
            room = "святилище";
        } else if (choice === "4") {
            room = "босс";
        } else {
            alert("Такого прохода нет.");
        }
    }
    if (room === "сад") {
        const choice = prompt(
            "ИСКРЯЩИЙСЯ САД\n" +
            "Воздух в этой комнате полон ароматов экзотических цветов, но магической травы здесь нет, лишь короткостриженный газон.\n" +
            "Ваши глаза слепит из-за непривычной яркости, а внимание привлекает отдельно стоящее дерево.\n" +
            "1 — Осмотреть газон в центре комнаты\n" +
            "2 — Поискать под деревом\n" +
            "3 — Вернуться в восточный коридор\n" +
            "0 — Завершить игру"
        );
        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "в центре";
        } else if (choice === "2") {
            room = "под деревом";
        } else if (choice === "3") {
            room = "восточный коридор";
        } else {
            alert("Такого прохода нет.");
        }
    }
    if (room === "в центре") {
        let choice
        if (inventory.includes("лейка")) {
            choice = prompt(
                "Может трава вырастет если полить её из лейки?\n" +
                "1 — Вернуться ко входу в сад\n" +
                "2 — Полить траву\n" +
                "3 — Не поливать, и вернуться ко входу в сад\n" +
                "0 — Завершить игру"
            );
            if (choice === "0" || choice === null) {
                break;
            } else if (choice === "1") {
                room = "сад";
            } else if (choice === "2") {
                room = "трава";
            } else if (choice === "3") {
                room = "сад";
            } else {
                alert("Такого прохода нет.");
            }

        } else {
            choice = prompt(
                "Трава здесь будто сострижена, но явно отличается от той что растет по всей комнате.\n" +
                "1 — Вернуться ко входу в сад\n" +
                "0 — Завершить игру"
            );
        }
    }
    if (room === "трава") {
        choice = prompt(
            "Она действительно выросла, сорвать траву?\n" +
            "1 — Сорвать немного магической травы\n" +
            "2 — Вернуться ко входу в сад\n" +
            "0 — Завершить игру"
        );
        if (choice === "1") {
            const takeGrass = confirm("Забрать магическую траву и положить в инвентарь?");
            if (takeGrass === true) {
                inventory.push("трава");
                alert("Магическая трава добавлена в рюкзак!\n" +
                    "Осталось найти меч.");
            } else {
                alert("Вы не забрали магическую траву.");
            }
        }

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "2") {
            room = "сад";
        } else {
            alert("Такого прохода нет.");
        }
    }

    if (room === "под деревом") {
        const choice = prompt(
            "Под деревом растет пару необычных цветов, а на одной из веток висит небольшая лейка с водой.\n" +
            "1 — Взять лейку\n" +
            "2 — Вернуться ко входу в сад\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "лейка";
        } else if (choice === "2") {
            room = "сад";
        } else {
            alert("Такого действия нет.");
        }
    }
    if (room === "лейка") {
        const takeWater = confirm("Забрать лейку с ветки?");
        if (takeWater === true) {
            inventory.push("лейка");
            alert("Лейка добавлена в рюкзак!");
        } else {
            alert("Вы оставили лейку на дереве.");
        }
        alert(
            "Осталось найти меч"
        );
        const choice = prompt(
            "1 — Вернуться ко входу в библиотеку\n" +
            "0 — Завершить игру"
        );

        if (choice === "0" || choice === null) {
            break;
        } else if (choice === "1") {
            room = "сад";
        } else {
            alert("Такого прохода нет.");
        }
    }
}
alert("Игра завершена.");